app/controllers/bookmarks_controller.rb

INSERT INTO "bookmarks" ("movie_id", "list_id", "created_at", "updated_at", "comment") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["movie_id", 11], ["list_id", 4], ["created_at", "2023-04-01 05:14:58.656361"], ["updated_at", "2023-04-01 05:14:58.656361"], ["comment", "from studio ghibli\n"]]
---
  def create
    @bookmark = Bookmark.new(bookmark_params)
    @bookmark.list = @list
    if @bookmark.save

DELETE FROM "bookmarks" WHERE "bookmarks"."id" = $1  [["id", 3]]
---
  def destroy
    @bookmark.destroy

SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def set_list
    @list = List.find(params[:list_id])

SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def set_bookmark
    @bookmark = Bookmark.find(params[:id])